IDEA StatiCa Open Model
StageLoading Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Staged loading
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.Load.StageLoading
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class StageLoading
Public Class StageLoading
public ref class StageLoading
The StageLoading type exposes the following members.
Constructors
Name | Description
StageLoading
Initializes a new instance of the StageLoading class
Top
Properties
Name | Description
PermanentForces
 Primary internal force in section
Time
 Time
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.Load Namespace